<br>
<a href="mailto:kris@koehntopp.de">Kristian K&ouml;hntopp</a>&nbsp;
<br>
<a href="mailto:marit@koehntopp.de">Marit K&ouml;hntopp</a>&nbsp;
<br>
<a href="mailto:ms@netuse.de">Martin Seeger&nbsp;</a> &nbsp; <br>
&nbsp; 

<div align="right">Kiel, 14.05.97<br>
<a href="index.en.html">english language version</a></div>

<h3>Zusammenfassung&nbsp;</h3>

Wie alle anderen Medien wird auch das Internet zur Verbreitung von
beispielsweise rechtsradikalen oder kinderpornographischen
Informationen mi&szlig;braucht. Dies hat in letzter Zeit den Ruf
nach einem staatlichen Eingriff laut werden lassen, um zentrale
Sperrungen bestimmter Inhalte zu erreichen.&nbsp; 

<p>Die Autoren halten einen solchen Schritt fuer nicht angemessen.
Zum einen haben bisher alle technischen Ans&auml;tze zur
Realisierung versagt. Strukturelle &Uuml;berlegungen lassen
vermuten, da&szlig; dies auch in Zukunft der Fall sein wird. Auf
der anderen Seite haben Sperren stets Auswirkungen auch auf
Bereiche, deren Sperrung nicht beabsichtigt ist. Diese
Nebenwirkungen sind um so schwerwiegender, je wirksamer die Sperren
sein sollen.&nbsp;</p>

<p>Dezentrale L&ouml;sungsansaetze koennen dem Nutzer die
Moeglichkeit geben, im eigenen Bereich selbstverantwortlich Inhalte
zu filtern. Bewertungen von Inhalten durch nichtstaatliche
Organisationen k&ouml;nnen dazu f&uuml;ehren, da&szlig; der
Bewertungsmechanismus zur Durchsetzung fragw&uuml;rdiger Interessen
mi&szlig;braucht wird. Um diesem Risiko entgegenzuwirken, ist es
unverzichtbar, da&szlig; nicht nur die
Bewertungsma&szlig;st&auml;be, sondern auch die Bewertungen selbst
vollst&auml;ndig offengelegt werden.&nbsp;</p>

<p>Jede Art von staatlicher Regulierung treibt die Kosten in die
H&ouml;he. Es ist abzusehen, da&szlig; der Versuch, Inhalte im
Internet zu bewerten, sehr personalintensiv sein wird. Bereits
heute sind die Kommunikationskosten am Standort Deutschland
wesentlich h&ouml;her als bei konkurrierenden Nationen wie den USA.
Regulierungen k&ouml;nnen daher zu einem Standortnachteil
f&uuml;hren.&nbsp;<br>
&nbsp;</p>

<h3>Was soll mit einer Sperrung erreicht werden?&nbsp;</h3>

Bevor man &uuml;ber technische Ma&szlig;nahmen zur Sperrung von
Inhalten im Internet und die Chancen ihrer Realisierung reden kann,
mu&szlig; man sich dar&uuml;ber klar werden, welche Ziele man mit
einer solchen Sperrung erreichen m&ouml;chte. M&ouml;gliche Ziele
sind:&nbsp; <br>
&nbsp; 

<ul>
<li><b>Law Enforcement:</b> Man moechte verhindern, da&szlig; nach
den Kriterien einer nationalen oder regionalen Rechtsordnung
strafrechtlich relevantes Material f&uuml;r die Subjekte dieser
Rechtsordnung erreichbar ist bzw. von ihnen ver&ouml;ffentlicht
werden kann, und zwar auch dann, wenn der Ort der
Ver&ouml;ffentlichung au&szlig;erhalb des Durchsetzungsbereiches
dieser Rechtsordnung liegt. Traumziel w&auml;re es, das Begehen
solcher Straftaten technisch unm&ouml;glich zu machen.&nbsp;</li>

<li><b>Indecency:</b> In den USA wurde mit dem <i>communication
decency act</i> (<i>CDA</i>) in seinen verschiedenen Formulierungen
und Gesetzesvorlagen versucht, eine noch weitergehende Regelung zu
etablieren: Es sollte verboten werden, Material ueber Datennetze
zug&auml;nglich zu machen, das <i>indecent</i> ist, d.h. nach den
Grunds&auml;tzen der jeweils herrschenden Moraldefinition
ungeh&ouml;rig, obsz&ouml;n oder in anderer Weise st&ouml;rend (zu
Free Speech siehe z.B. <a href="http://www.eff.org">The Electronic
Frontier Foundation,</a> EFF).&nbsp;</li>

<li><b>Jugendschutz:</b> Nur Minderj&auml;hrigen (Kindern und
Jugendlichen) soll der Zugang zu bestimmten Materialien verwehrt
werden, w&auml;hrend Vollj&auml;hrigen weiterhin die gesamten
Inhalte des Internet zug&auml;nglich bleiben sollen.&nbsp;</li>

<li><b>Rating:</b> F&uuml;r jeden Teilnehmer im Netz soll weiterhin
frei definierbar sein, welches Material empfangen/nicht empfangen
werden soll, aber es soll eine Bewertungsstruktur geschaffen
werden, die es jedem Konsumenten in eigener Verantwortung
erm&ouml;glicht, seine Pr&auml;ferenzen anzugeben (kein Sex/viel
Sex, keine Gewalt/Blood and Splatter, politisch links/politisch
rechts, konform mit den Vorstellungen der katholischen
Kirche/islamisch korrekt) und nur noch den Ausschnitt aus dem
Internet wahrzunehmen, der diesen selbstgew&auml;hlten Filter
passieren kann.&nbsp;</li>

<li><b>Nichtregulation:</b> Jeder Netzteilnehmer soll freien
Zugriff auf alle angebotene Information haben. Sogar die Existenz
von Bewertungskriterien Dritter wird als sch&auml;dlich angesehen
und die Bildung einer Bewertungsinfrastruktur nicht gef&ouml;rdert
bzw. sogar behindert.&nbsp;</li>
</ul>

<h3>Welche Dienste werden betrachtet?&nbsp;</h3>

Unter der Bezeichnung <i>Inhalte im Internet</i> wird in der Regel
eine ganze Reihe von Diensten subsumiert, die technisch vollkommen
unterschiedlich realisiert werden und administrativ zu gro&szlig;en
Teilen disjunkte Strukturen aufweisen. Allen Diensten ist lediglich
gemeinsam, dass ihnen das Daten&uuml;bertragungsprotokoll TCP/IP
zugrunde liegt.&nbsp; 

<p>Man mu&szlig; mindestens die beiden folgenden Dienste
unterscheiden:&nbsp;<br>
&nbsp;</p>

<ul>
<li><b>WWW, World Wide Web:</b> Das World Wide Web ist der
graphisch ansprechendste Dienst des Internet. Es handelt sich um
Server, die auf die Anfrage eines Benutzers Seiten beliebigen
Inhaltes an das Darstellungsprogramm (<i>Browser</i>) auf seinem
Rechner ausliefern. Der Zugriff auf diese Seiten erfolgt in der
Regel mit Hilfe des HyperText Transport Protocol (<i>HTTP</i>).
Dieses Protokoll erfordert keine Identifizierung oder
Authentisierung des Abrufers und des Anbieters; die Daten werden im
Klartext und nicht f&auml;lschungssicher
&uuml;bermittelt.&nbsp;</li>

<li style="list-style: none">
<p>Eine optional einsetzbare Modifikation von HTTP &uuml;bermittelt
Anfragen und Antworten mit Hilfe des
Verschl&uuml;sselungsverfahrens <i>Secure Socket Layer</i>
(<i>SSL</i>). Bei diesem Verfahren mu&szlig; sich mindestens der
Anbieter gegen&uuml;ber dem Abrufer identifizieren. Weiterhin ist
sichergestellt, da&szlig; die Verbindung nicht im Klartext
abh&ouml;rbar ist (Dritten wird nicht bekannt, welche Anfragen
gestellt wurden oder welche Inhalte die ausgelieferten Seiten
haben) und da&szlig; Inhalte nicht durch Dritte w&auml;hrend der
&Uuml;bertragung unerkannt verf&auml;lscht werden
k&ouml;nnen.&nbsp;</p>

<p>Die abgerufenen Seiten bestehen aus Formatierungsanweisungen der
<i>HyperText Markup Language</i> (<i>HTML</i>) und optional
weiteren Bild-, Ton- oder Videodaten. Bei kleineren Servern liegen
die abrufbaren Seiten h&auml;ufig statisch als vorgefertigte und
unver&auml;ndert ausgelieferte Dateien auf der Festplatte vor.
Gr&ouml;&szlig;ere Server erzeugen die Seiten jedoch oftmals
dynamisch in Abh&auml;ngigkeit von der Identit&auml;t des Abrufers,
seiner Netzadresse, seiner bevorzugten Landessprache (im Browser
konfigurierbar), dem vom Abrufer verwendeten Browsertyp, der
Uhrzeit des Abrufs oder anderen Kriterien, die frei progammierbar
sind. Es ist also nicht sichergestellt, da&szlig;zwei
aufeinanderfolgende Abfragen derselben Seite identische Antworten
ergeben.&nbsp;</p>

<p>Falls die Seiten aus einer Datenbank dynamisch erzeugt werden,
kann sich der Datenbestand des Webservers durch die Updates der
Datenbank st&auml;ndig aendern. Dies ist zum Beispiel der Fall bei
Katalogsystemen fuer Onlinehandel (Preis- und Produktupdates,
&Auml;nderungen im Lagerbestand mit Auswirkungen auf die
Lieferbarkeit usw.), bei Nachrichtenagenturen mit Anschlu&szlig; an
Presse- und Tickerdienste und bei Webverzeichnissen und
Suchmaschinen, die einen Volltextindex f&uuml;r Seiten generieren
und eine Recherche nach Inhalten erlauben.&nbsp;</p>

<p>Grunds&auml;tzlich ist der Datenbestand im Web als h&ouml;chst
dynamisch anzusehen: Neue Versionen von Seiten lassen sich zu sehr
geringen Kosten erzeugen und in Verkehr bringen. Der elektronische
Charakter des Mediums im Zusammenhang mit der zentralen
Datenhaltung (es sind keine verteilten Kopien einer Seite auf Stand
zu bringen) beg&uuml;nstigen weiterhin eine sehr hohe
Auflagenfrequenz.&nbsp;</p>
</li>

<li>USENET News: Das USENET ist ein verteiltes System vom
Diskussionsforen (<i>Newsgroups</i>). Es handelt sich um ein
teilweise zusammenh&auml;ngendes Netz von Servern, von denen jeder
eine Auswahl von Artikeln zum Abruf bereith&auml;lt. Die Artikel
sind in der Regel in thematisch gegliederten Diskussionsforen in
der Reihenfolge des Eingangs abgelegt. Leser k&ouml;nnen eine
Verbindung zum netztopologisch am g&uuml;nstigsten gelegenen Server
aufbauen und Artikel nach Diskussionsforen und Eingangsdatum
selektiert abrufen.&nbsp;</li>

<li style="list-style: none">
<p>Leser k&ouml;nnen grunds&auml;tzlich auf jeden gelesenen Artikel
antworten (<i>to follow up on an article</i>) oder unabh&auml;ngig
eigene Artikel auf dem Server ablegen (<i>posten</i>, von engl. <i>
to post a notice</i>). Der Server wird dann seine Nachbarserver
dar&uuml;ber informieren, da&szlig;er einen neuen Artikel
vorr&auml;tig hat, und den Artikel ggf. an seine Nachbarserver
replizieren (<i>to feed an article to a neighboring system</i>).
Diese verbreiten den Artikel dann wieder an ihre Nachbarn usw.
(<i>flood fill algorithm of USENET</i>). Nach einigen Stunden
existieren Hunderttausende von Kopien dieses Artikels auf der
gesamten Welt. Die Vernetzung der Server ist hochredundant;
Unterbrechungen in Serverstrecken haben in der Regel keine oder nur
lokal me&szlig;bare Auswirkungen auf Verf&uuml;gbarkeit oder
Transportgeschwindigkeit der Artikel.&nbsp;</p>

<p>Um Platz zu gewinnen, werden die jeweils &auml;ltesten Artikel
nach einiger Zeit gel&ouml;scht. Die genaue Zeitspanne bis zur
L&ouml;schung h&auml;ngt von der individuellen Konfiguration des
Servers und seiner Platzsituation ab, liegt aber in der Regel nicht
&uuml;ber 14 Tagen. Es existieren jedoch auch einige Newsarchive,
die Diskussionen &uuml;ber mehrere Jahre hinweg abspeichern und
diesen Datenbestand durch weitgehende Recherchem&ouml;glichkeiten
erschliessen (z.B.&nbsp; <a href="http://www.dejanews.com/">
DejaNews</a>, <a href="http://www.altavista.digital.com/">
AltaVista</a> im Newsmodus).&nbsp;</p>

<p>Dadurch, da&szlig; jeder Leser auf beliebige Artikel direkt und
ohne redaktionelle Bearbeitung antworten kann, entspinnen sich in
der Regel unmoderierte, &ouml;ffentliche Diskussionen zu allen
m&ouml;glichen Themen. Ein Gro&szlig;teil der Diskussionsforen wird
global ausgetauscht. Daher ist die Zusammensetzung der
Diskussionsrunden zuf&auml;llig und international.&nbsp;</p>

<p>Die Kommunikation zwischen Leser und Server sowie die
Kommunikation zwischen den Servern erfolgt in der Regel
unverschl&uuml;sselt und ohne Identifizierung und Authentisierung
der Leser oder der Autoren von Artikeln. Die F&auml;lschung von
Absenderadresse oder Herkunftspfad eines Artikels ist trivial und
in einigen Diskussionsforen sogar &uuml;blich. Es existieren
Konverter von E-Mail nach USENET News und Anonymous- sowie
Pseudonymous-Server, die zum Teil mit kryptographisch starken
Methoden die Identit&auml;t des Absenders sowie seinen
Aufenthaltsort im Netz zu verschleiern suchen. Einige Newsserver
lassen Lese- und Schreibzugriff von jedermann und ohne
Authentisierung zu (<i>open servers</i>); es ist Sache des
Ver&ouml;ffentlichenden, seine Identit&auml;t in einem Artikel
offenzulegen oder nicht.&nbsp;</p>

<p>Die Entscheidung &uuml;ber die von einem Server angebotenen
Diskussionsforen obliegt in der Regel jedem einzelnen
Serverbetreiber. Teilweise existieren Kataloge von offiziellen
Newsgroups, diese sind jedoch in der Regel weder vollst&auml;ndig
noch f&uuml;r irgendwen verbindlich. Name oder &Uuml;berschrift
einer Newsgroup haben nur den Charakter von Empfehlungen.
Thematisch falsch eingeordnete Artikel (<i>off topic postings</i>)
oder bewu&szlig;t massenhaft in alle Newsgroups verbreitete Artikel
(<i>spam</i>) machen einen festen Anteil aller Artikel
aus.&nbsp;</p>
</li>
</ul>

Die Dienste <i>IRC</i> (<i>Internet Relay Chat</i>) und <i>
E-Mail</i> (Private elektronische Post sowie halb&ouml;ffentliche
Mailinglists als Diskussionsforen) w&auml;ren ebenfalls zu
betrachten, sollen hier aber im Interesse einer kompakten
Darstellung nicht diskutiert werden, da sie weniger im Rampenlicht
der &ouml;ffentlichen Diskussion stehen. Die genannten Argumente
gelten aber in &auml;hnlicher Form auch dort. Es existieren weitere
Dienste, die fuer die &ouml;ffentliche Kommunikation in der Regel
von geringerer Bedeutung sind (<i>telnet</i>) oder deren Diskussion
keine neuen Aspekte zu Tage foerdern wuerde (<i>ftp</i>, siehe <i>
http</i>).&nbsp; 

<h3>Wie koennen zu sperrende Inhalte identifiziert
werden?&nbsp;</h3>

Um Inhalte zuverl&auml;ssig sperren zu koennen, ist es notwendig,
diese Inhalte in irgendeiner Form zu identifizieren. Diese
Identifizierung kann von unterschiedlicher Aufl&ouml;sung
sein.&nbsp; 

<p>Auf der Basis von IP-Adressen kann ein einzelner Rechner
identifiziert werden. Ein solcher Rechner erbringt jedoch in der
Regel eine Vielzahl von Diensten f&uuml;r mehrere unterschiedliche
Anbieter. Webserver von IP-Providern bringen unter einer IP-Adresse
teilweise die Angebote von Tausenden Inhaltsanbietern ins Netz,
Rechner von Kleinprovidern bieten teilweise alle Dienste des
Providers unter einer IP-Nummer an. Eine Sperrung von IP-Nummern
trifft also au&szlig;er den zu sperrenden Inhalten meist auch eine
gro&szlig;e Menge von Inhalten und Diensten, deren Sperrung nicht
beabsichtigt ist.&nbsp;</p>

<p>Mit entsprechendem Mehraufwand k&ouml;nnen dienstspezifische
Kennzeichen von einzelnen Einheiten des Angebotes identifiziert
werden. Im World Wide Web ist dies der Name einer Seite (ihr <i>
Universal Resource Locator</i>, <i>URL</i>), in den USENET News
erfolgt die Identifizierung &uuml;ber die Message-ID einer
einzelnen Nachricht oder den Namen einer Newsgroup. F&uuml;r neu
entstehende Dienste m&uuml;ssen dienstspezifische Methoden zur
Identifikation einzelner Einheiten neu gefunden werden.&nbsp;</p>

<p>Die zu bewertenden Datenmengen sind riesig: Die Suchmaschine <a
href="http://www.altavista.digital.com/">Altavista</a> hatte im Mai
1996 schon 30 Millionen Webseiten in ihrer Volltextdatenbank
gespeichert; im April 1997 betrug das Newsaufkommen mehr als 72
Gigabyte f&uuml;r etwa 5,4 Millionen Artikel (Statistik von Eunet
Deutschland GmbH aus <a href="news:de.admin.lists">
de.admin.lists</a> vom 01.05.97).&nbsp;</p>

<p>Es bleibt das Problem, zu sperrende Inhalte aus der Menge aller
Inhalte zu isolieren. Hier gibt es nur zwei grunds&auml;tzlich
verschiedene Systeme:&nbsp;<br>
&nbsp;</p>

<ul>
<li>Die automatische Bewertung von Inhalten auf der Basis formaler
Merkmale wie etwa dem Vorhandensein bestimmter
Schl&uuml;sselworte.&nbsp;</li>

<li>Die manuelle Bewertung von Inhalten durch den Anbieter oder
Dritte nach bestimmten Kriterienkatalogen
(<i>rating</i>).&nbsp;</li>
</ul>

Verfahren zur automatischen Bewertung von Inhalten aufgrund von
Schl&uuml;sselworten scheitern bei Komponenten, die keinen Text
enthalten (Audiodateien, Bilder oder Animationen) schon im Ansatz.
Einige Online-Dienste (Prodigy, AOL) haben versucht, Diskussionen
in dem IRC-Dienst &auml;hnlichen Chatr&auml;umen aufgrund des
Gebrauchs bestimmter Schl&uuml;sselworte bewerten zu lassen; die
Ergebnisse waren wenig befriedigend. Einerseits waren normale
Diskussionen &uuml;ber bestimmte Themen nicht mehr m&ouml;glich:
Eine Sperrung des Wortes <i>suck</i> erschwerte den
Meinungsaustausch zu Staubsaugern in einem Haushaltsforum, eine
Sperrung des Wortes <i>breast</i> behinderte Diskussionen &uuml;ber
Brustkrebs oder Kochrezepte (H&uuml;hnerbrust), und die Webseiten
von Frau Cindy Tittle Moore (tittle@netcom.com) wurden durch das
Programm Cybersitter wegen ihres Namens gesperrt.&nbsp; 

<p>Andererseits ver&auml;nderte die eigentliche Zielgruppe einfach
ihr Vokabular, so da&szlig; die Sperrung auf diese Zielgruppe keine
nennenswerte Auswirkung hatte. Auch andere automatisierbare
Bewertungsmethoden verm&ouml;gen nicht die Semantik der Inhalte zu
erkennen. Wer solche formalen Sperrkriterien kennt, kann leicht die
Darstellung seiner Informationen je nach Bedarf an diese Kriterien
anpassen, ohne die inhaltliche Aussage zu ver&auml;ndern. Das
Kindersicherungsprogramm Cybersitter ist beispielsweise in der
Lage, als offensive eingestufte Worte aus Webseiten
herauszuschneiden. Durch geschickte Formulierung sind so Aussagen
in ihr Gegenteil verkehrbar, wenn sie unter Cybersitter betrachtet
werden (Nachricht von Bennett Haselton auf der Mailingliste <a
href="mailto:fight-censorship@vorlon.mit.edu">
fight-censorship@vorlon.mit.edu</a>, Message-ID:
&lt;01IAZF6R8I0I8XKGCV@ctrvax.Vanderbilt.Edu&gt;).&nbsp;</p>

<p>Verfahren und Standards zur Bewertung von Inhalten durch den
Anbieter oder Dritte liegen f&uuml;r den Bereich des World Wide Web
bereits vor, das System <a href="http://www.w3.org/pub/WWW/PICS/">
PICS</a> (Platform for Internet Content Selection) ist dabei zur
Zeit f&uuml;hrend. PICS erlaubt die Installation frei definierbarer
Bewertungsma&szlig;st&auml;be mit einer beliebig feinen
Aufl&ouml;sung. Bewertungen von URLs koennen von den Anbietern
selbst oder durch Dritte erfolgen. G&auml;ngige
Bewertungsma&szlig;staebe sind dabei etwa Gewalt, Sex oder
unanst&auml;ndige Sprache, die Abstufungen reichen von digitalen
0-1-Skalen bis zu sehr fein abgestuften Systemen. Die Auswertung
von PICS-Einstufungen kann entweder im Clientprogramm des Anwenders
erfolgen (dies wird zur Zeit vom Microsoft Internet Explorer
unterstuetzt) oder auf Routern auf dem Weg zum Empf&auml;nger (dies
geschieht zur Zeit nicht).&nbsp;</p>

<p>Das Hauptproblem bei der manuellen Bewertung von Inhalten ist
die gro&szlig;e Menge der anfallenden neuen oder ver&auml;nderten
Seiten. Der Betreiber des Nachrichtenservers <a href=
"http://www.msnbc.com/">www.msnbc.com</a> (Joint-Venture von NBC
und Microsoft) hat die Bewertung seiner Beitr&auml;ge auf der Basis
des von Microsoft gef&ouml;rderten Bewertungsschemas RSACi f&uuml;r
PICS eingestellt, da die Bewertung einzelner Beitr&auml;ge zu
aufwendig war und eine Pauschalbewertung des Servers nach den
Regeln von PICS den Server fuer Minderj&auml;hrige
unzug&auml;nglich gemacht haette (Briefwechsel zwischen Irene
Graham, Michael Sims, Stephen Balkam (RSAC Ratingaufsicht) und
Danielle Bachelder (MSNBC Systembetrieb), zitiert in
&lt;3339dd1a.500215@mail.thehub.com.au&gt; und
&lt;199703191314.IAA03203@arutam.inch.com&gt; auf derselben
Mailingliste).&nbsp;</p>

<p>Hinzu kommt, dass die Webseite abh&auml;ngig vom Kontext des
Abrufes unterschiedlich aussehen kann, so da&szlig; eine Bewertung
nach dem PICS-System problematisch w&auml;re. Gerade diejenigen
Seiten, die die interaktive Komponente des Internet ausnutzen,
k&ouml;nnten so wegen ihrer dynamischen Generierung aus der
Bewertung herausfallen und w&uuml;erden damit in entsprechend
konfigurierten Browsern und Suchmaschinen nicht mehr
dargestellt.&nbsp;</p>

<p>Die Bewertung von Angeboten erfolgt im Rahmen von PICS derzeit
durch private Organisationen. Die M&ouml;glichkeiten des
Widerspruchs gegen eine bestimmte Einstufung sind dabei begrenzt.
Insbesondere ist es f&uuml;r einen B&uuml;rger schwierig, ein
korrektes Rating einzufordern, wenn die Ratingorganisation in einem
fremden Land sitzt. Im Prinzip liegt hier dasselbe Problem vor, das
sich zur Zeit bei der Strafverfolgung ausl&auml;ndischer illegaler
Angebote stellt, nur da&szlig; die Ressourcen und Beweislasten nun
andersherum verteilt sind: Ein Anbieter mu&szlig; nun bei falscher
Einstufung beweisen, dass sein Angebot legal ist, und er mu&szlig;
dazu den schwierigen Weg der Durchsetzung von Anspr&uuml;chen im
Ausland gehen. Im Vergleich zu einer Staatsanwaltschaft ist ein
Anbieter von Webseiten daf&uuml;r im Durchschnitt schlechter
ausgebildet, und ihm stehen weniger Ressourcen zur
Verf&uuml;gung.&nbsp;</p>

<p>Weiterhin orientieren sich die Ratingorganisationen an Werten
und kulturellen Ma&szlig;st&auml;ben ihrer Nation. Die
&Uuml;bernahme ausl&auml;ndischer Bewertungen f&uuml;r deutsche
Benutzer ist daher problematisch. Da jedoch keine deutsche
Zugriffssoftware existiert, werden meist nur ausl&auml;ndische
(speziell US-amerikanische) Ratingsysteme
unterst&uuml;tzt.&nbsp;</p>

<p>Die meisten Ratingorganisationen dokumentieren ihre Ratings
nicht oder nur sehr ungern. Zum Teil erfolgt noch nicht einmal eine
Benachrichtigung des Bewerteten &uuml;ber die Bewertung seines
Angebotes. Vollst&auml;ndige Verzeichnisse aller vergebenen Ratings
werden meist mit der Begr&uuml;ndung unter Verschluss gehalten,
da&szlig; diese Verzeichnisse als Kataloge fuer Schmutz und Schund
mi&szlig;braucht werden k&ouml;nnten. Bei den Programmen, die die
Bewertungen von Webseiten Dritter nicht online beziehen, sondern
als Datei auf der lokalen Festplatte installiert haben, ist diese
Liste grunds&auml;tzlich verschl&uuml;sselt - und meistens auch
veraltet. Auch gegen&uuml;ber dem Benutzer solcher Software ist
damit nicht offengelegt, welche Angebote ihm nicht mehr
zug&auml;nglich sind.&nbsp;</p>

<p>Inzwischen existieren (illegal) entschl&uuml;sselte Versionen
der Sperrlisten aller Hersteller von Programmen mit statischer, in
Dateien gelieferter Sperrliste. Die Auswertung der Sperrungen hat
bei allen Herstellern eine klare politische Agenda und
pers&ouml;nliche Feindschaften dokumentiert. Beispielsweise wurden
vielfach Angebote von <i>womens organizations</i>,
Informationsangebote &uuml;ber Abtreibung und Angebote schwuler und
lesbischer Gruppen zensiert. Es ist weiterhin &uuml;blich,
Webseiten in die Sperrlisten aufzunehmen, die den Hersteller des
Sperrprogramms kritisieren, die Sperrliste offenlegen oder
allgemein gegen Rating argumentieren. Beim Hersteller des Programms
Cybersitter geht dies so weit, da&szlig; bei installiertem
Cybersitter alle Seiten nicht mehr abrufbar sind, in denen die
Namen von Kritikern seines Programms erw&auml;hnt werden.&nbsp;</p>

<h3>Mit welchen Mitteln kann eine Sperrung erreicht
werden?&nbsp;</h3>

Sperrungen k&ouml;nnen auf unterschiedlichen Ebenen der
Kommunikation ansetzen:&nbsp; 

<p>Um erfolgreich zu kommunizieren, m&uuml;ssen beide
Kommunikationspartner eine physikalische Verbindung zueinander
aufbauen. Dies kann eine Standleitung, eine Telefonleitung, eine
Richtfunkstrecke oder eine andere Kommunikationsform sein. Eine
normalerweise nicht praktikable M&ouml;glichkeit der Sperrung
besteht darin, diese physikalische Kommunikation zu verhindern,
indem man etwa einen Telefonanschluss sperrt oder bestimmte
Telefonnummern nicht erreichbar schaltet, Standleitungen
unterbricht oder St&ouml;rsender in Richtfunkstrecken einbringt.
Das Opfer der Sperrung verliert damit in der Regel alle seine
Kommunikationsm&ouml;glichkeiten.&nbsp;</p>

<p>Im Internet wird meist keine homogene physikalische Verbindung
verwendet, sondern diese Verbindung wird aus Teilst&uuml;cken
unterschiedlicher Technologie zusammengest&uuml;ckelt. An den
&Uuml;bergangspunkten zwischen den Teilstuecken befindet sich ein
Router, der IP-Pakete von einem Teilst&uuml;ck zum n&auml;chsten
hinueberhievt. Die Funktionalit&auml;t des Routers wird dabei von
den Adressen in den einzelnen IP-Paketen und seinen Routingtabellen
gesteuert. In den Routingtabellen ist eingetragen, in welche
Richtung der Router Pakete mit einer gegebenen Zieladresse
weiterzuleiten hat. Die klassische Dienstleistung eines Providers
besteht darin, einen &Uuml;bergang zwischen einer
W&auml;hlverbindung (Privatkunden) oder einer regionalen
Standleitung (Firmenkunden) und einer oder mehreren Standleitungen
in das Ausland zu bieten. Dem Provider ist dabei nicht bekannt,
welche Dienste der Kunde in Anspruch nimmt oder welche Daten
abgerufen werden.&nbsp;</p>

<p>Sperrungen k&ouml;nnen hier &uuml;ber Eingriffe in die
Routingtabellen von Routern vorgenommen werden. Es ist
beispielsweise leicht m&ouml;glich, alle Pakete an bestimmte
Zieladressen am Router verwerfen zu lassen (eine Route zu <i>
erden</i>). Mit diesem Verfahren werden ganze Rechner unerreichbar:
Bei der durch den DFN-Verein praktizierten Sperrung des Rechners
mit dem Namen <a href="http://www.xs4all.com/">www.xs4all.com</a>
waren auf diese Weise die Webseiten von mehr als 6000 Anbietern
nicht mehr abrufbar, es konnte keine Mail auf der Maschine
www.xs4all.com eingeliefert werden, und auch alle andere
Kommunikation des DFN-Vereins mit dieser Maschine wurde
unterbunden.&nbsp;</p>

<p>Die Auswahl eines Dienstes erfolgt im TCP/IP-Protokoll in der
Regel durch die Angabe einer TCP-Portnummer. Mit Hilfe dieser
Portnummer k&ouml;nnte eine selektivere Sperrung eines Dienstes
erfolgen. Beispielsweise sind einige Router in der Lage, nach
entsprechender Konfiguration TCP-Verkehr fuer den Port 80 (HTTP) zu
einer Zieladresse zu sperren, Verkehr auf Port 25 (Mail) zu
derselben Adresse aber zu gestatten.&nbsp;</p>

<p>Mit Hilfe eines Vermittlungsrechners (<i>proxy</i>) oder anderer
Firewallsoftware, denen die im Netzmodell h&ouml;her liegenden
Ebenen zug&auml;nglich sind, kann eine selektive Sperrung auf der
Ebene von Dienstelementen (einzelnen Seiten, einzelnen Nachrichten)
erreicht werden. Die Firewallsoftware mu&szlig; herbei jedoch fuer
jeden Dienst (WWW, News, Mail, IRC etc.) angepa&szlig;t werden.
Solche Systeme sind in der Regel sehr aufwendig im Betrieb, da sie
f&uuml;r die nutzenden Clients die volle Leistung aller durch den
Client in Anspruch genommenen Dienste simulieren m&uuml;ssen. Mit
steigender Zahl von Clients skalieren sich diese Systeme
ausgesprochen schlecht. Trotzdem setzen einige totalit&auml;re
Staaten auf dieses System, um das Eindringen mi&szlig;liebiger
Inhalte in das Land zu erschweren: In China, Singapur und in den
Golfstaaten l&auml;uft saemtliche Kommunikation mit dem Ausland
durch staatlich betriebene Firewalls.&nbsp;</p>

<p>Sperrung von IP-Adressen und der Einsatz von Firewalls ist unter
bestimmten Voraussetzungen kombinierbar, dadurch ist eine
Entlastung der Firewallmaschine m&ouml;glich: Anstatt die Route zu
einer zu sperrenden Maschine zu erden, l&auml;&szlig;t man alle
Routen zur zu sperrenden Maschine auf einen Firewall zeigen, der
dann die Dienste der zu sperrenden Maschine &uuml;berwacht. Diese
L&ouml;sung ist je nach Art der zu sperrenden und zu simulierenden
Dienste sehr aufwendig zu konfigurieren und zu warten. Zum einen
setzt sie einen zentralen &Uuml;bergangspunkt zwischen dem zu
kontrollierenden deutschen Netz und dem Rest der Welt voraus. Zum
anderen handelt es sich bei diesem Verfahren um einen klassischen
<i>Man in the middle</i>-Angriff. Dadurch versagt das Verfahren bei
aller stark verschl&uuml;sselten Kommunikation, die unempfindlich
gegen solche Angriffe ist.&nbsp;</p>

<p>Grunds&auml;tzlich sind die Auswirkungen von Filtermechanismen
auf die Systemleistung um so h&ouml;her, je feiner die
Granularit&auml;t der Sperrungen ist und je gr&ouml;&szlig;er die
Liste der zu sperrenden Informationsquellen ist. Systeme wie PICS
lassen sich nicht effizient an zentralen Stellen im Netz
etablieren, sondern k&ouml;nnen nur dezentral funktionieren. Alle
bisher diskutierten Verfahren der Sperrung setzen auf dritten
Maschinen zwischen dem Anbieter der zu sperrenden Information und
dem Abrufer an. Denkbar w&auml;re auch eine Sperrung beim Anbieter
der Information sowie eine Sperrung beim Abrufer. Dies setzt jedoch
eine Kooperation des Anbieters bzw. Abrufers voraus.&nbsp;</p>

<p>Eine Sperrung beim Anbieter w&uuml;rde bedeuten, da&szlig; der
Anbieter die zu sperrenden Inhalte entweder niemandem anbietet oder
da&szlig; er sie nur bestimmten Personen nicht anbietet. Ein
personenselektives Anbieten von Inhalten setzt selbst bei
Kooperation des Anbieters voraus, da&szlig; der Anbieter den
Abrufer einer Information zweifelsfrei identifizieren kann und
da&szlig; ihm genaue und juristisch hieb- und stichfeste
Entscheidungstabellen vorgelegt werden, die es ihm erlauben,
automatisch zu entscheiden, wem er welche Inhalte ausliefern darf.
Ein Identifikationsmechanismus, der das Geforderte leistet,
existiert derzeit nicht einmal im Ansatz und ist auch nicht in
absehbarer Zeit realisierbar. Insbesondere kann nicht aus der
IP-Adresse oder dem Rechnernamen eines Absenders auf seine
Identit&auml;t oder seinen physikalischen Aufenthalt geschlossen
werden: Deutsche Kunden von amerikanischen Online-Diensten
erscheinen im Netz als aus den Vereinigten Staaten kommend.
&Auml;hnliches gilt f&uuml;r Mitarbeiter multinationaler
Konzerne.&nbsp;</p>

<p>Eine Sperrung beim Abrufer w&uuml;rde bedeuten, da&szlig; die
angebotenen Inhalte nach bestimmten Bewertungskriterien
ausgezeichnet sind (<i>rating</i>, z.B. nach PICS) und da&szlig;der
Abrufer selbst seine Software so konfiguriert, da&szlig; Seiten mit
bestimmten Ratings nicht mehr abgerufen werden k&ouml;nnen. Eine
Kooperation des Anbieters w&auml;re hier w&uuml;nschenswert, ist
aber nicht notwendig, da die Bewertungen auch von Servern Dritter
geliefert werden k&ouml;nnen.&nbsp;</p>

<h3>Auf welche Weise koennen Sperrungen unterlaufen
werden?&nbsp;</h3>

F&uuml;r den Nutzer stellt sich eine Sperrung von Inhalten als
Betriebsst&ouml;rung dar. Er wird nach Wegen suchen, die
ordnungsgem&auml;&szlig;e Funktion des Netzes wiederherzustellen,
d.h. die Sperrung zu unterlaufen. Diese Motivation ist um so
gr&ouml;&szlig;er, je st&auml;rker sich der Benutzer durch die
Sperrung behindert f&uuml;hlt.&nbsp; 

<p>Bei einer Sperrung der physikalischen Kommunikation ist dies nur
durch einen Wechsel des Mediums m&ouml;glich: Wenn etwa ein
St&ouml;rsender in Betrieb genommen wird, wird man versuchen, auf
das Telefonnetz auszuweichen und umgekehrt.&nbsp;</p>

<p>Bei einer Sperrung von bestimmten IP-Adressen stehen dem
Benutzer mehrere M&ouml;glichkeiten offen, die St&ouml;rung zu
umgehen. Alle laufen darauf hinaus, den sperrenden Router
vollst&auml;ndig zu umgehen (siehe auch <a href=
"http://www.fitug.de/ulf/zensur/">Ulf Moeller: Internet-Zensur:
Routingsperren umgehen</a>):&nbsp;<br>
&nbsp;</p>

<ul>
<li>Der Benutzer wechselt den Internet-Anbieter, notfalls wird er
Kunde bei einem ausl&auml;ndischen Provider. Er baut eine
Telefonverbindung oder Standleitung zu diesem Provider auf und
wickelt seine Kommunikation &uuml;ber diesen nichtsperrenden
Provider ab. Der sperrende Router des lokalen Providers wird nicht
mehr verwendet, die Sperre ist wirkungslos.&nbsp;</li>

<li style="list-style: none">
<p>Diese Situation tritt automatisch ein, wenn der Nutzer
Mitarbeiter eines (multinationalen) Konzerns mit einem eigenen
Konzernverbundnetz ist, das an mehreren Stellen (im Ausland) mit
dem Internet verbunden ist.&nbsp;</p>
</li>

<li>Der Benutzer wird Kunde bei einem zweiten, nichtsperrenden
Internet-Anbieter, notfalls im Ausland. Er baut eine
TCP/IP-Verbindung zu diesem Provider auf und l&auml;&szlig;t seine
Anwendungen auf dem entfernten Rechner, ggf. im Ausland,
ablaufen.&nbsp;</li>

<li style="list-style: none">
<p>Es gibt inzwischen eine Reihe von Providern, die solche Angebote
routinem&auml;&szlig;ig anbieten. Die Palette reicht dabei von der
Bereitstellung einzelner Dienste (Postboxen fuer E-Mail (z.B. <a
href="http://www.pobox.com/">pobox.com</a>), Webservices (z.B. <a
href="http://www.geocities.com/">geocities.com</a>) usw.) bis zu
kompletten Exil-Logins (z.B. <a href="http://www.c2.org">
c2.org</a>, <a href="http://www.acm.org/">acm.org</a>, <a href=
"http://www.xs4all.nl/">xs4all.nl</a>).&nbsp;</p>

<p>Der sperrende Router des lokalen Providers sieht keine
Kommunikation mit einer gesperrten Adresse, sondern nur
Kommunikation mit dem entfernten Provider. Die Zugriffe auf die
gesperrten Adressen erfolgen von dort, also erst hinter dem
sperrenden Router. Die Sperre durch den Router wird
wirkungslos.&nbsp;</p>
</li>

<li>Der Benutzer wird Kunde bei einem zweiten, nichtsperrenden
Internet-Anbieter, notfalls im Ausland. Er baut eine
Mobile-IP-Verbindung zu diesem Provider auf, d.h. seine IP-Pakete
werden in anderen IP-Paketen verpackt zum zweiten Internet-Anbieter
geschickt, dort ausgepackt und eingespielt. Optional kann die
Kommunikation zum zweiten Provider verschl&uuml;sselt
erfolgen.&nbsp;</li>

<li style="list-style: none">
<p>In Linux m&uuml;ssen dazu die folgenden beiden Kommandos gegeben
werden:&nbsp;</p>

<ol>
<li>Aktivierung des Interface <tt>tunl0</tt> zum entfernten
Anbieter <tt>myriad.ml.org</tt>&nbsp;</li>

<li style="list-style: none"><br>
<tt>&gt; ifconfig tunl0 (your.ip.address) pointopoint
myriad.ml.org</tt>&nbsp;</li>

<li>Legen einer Route zu <tt>www.xs4all.nl</tt> ueber <tt>
tunl0</tt>&nbsp;</li>

<li style="list-style: none"><br>
<tt>&gt; route add www.xs4all.nl tunl0</tt>&nbsp; 

<p>F&uuml;r einen Beobachter erscheint der Nutzer als normaler
Kunde des zweiten IP-Providers. Der sperrende Router des lokalen
Providers sieht nur eine Verbindung zum entfernten zweiten
Provider. Die Sperre ist wirkungslos. Mobile-IP ist ein
Routineangebot fuer IP-Provider, die Gesch&auml;ftskunden
betreuen.&nbsp;</p>
</li>
</ol>
</li>
</ul>

Der Anbieter der gesperrten Information kann Abrufer
unterst&uuml;tzen, indem er ebenfalls versucht, die Sperre zu
unterlaufen. Im Falle der Sperrung des Rechners <tt>
www.xs4all.nl</tt> hat der gesperrte Anbieter die Internet-Adresse
seines Rechners alle paar Minuten ver&auml;ndert. Sperrungen einer
einzelnen Adresse wurden dadurch wirkungslos, statt dessen
mu&szlig;ten ganze Teilnetze gesperrt werden (die Sperrung wurde
noch unspezifischer, es wurden als Nebenwirkung noch mehr
unbeteiligte Anbieter mitgesperrt).&nbsp; 

<p>W&auml;hrend die bisher diskutierten M&ouml;glichkeiten des
Unterlaufens von Sperrungen unabh&auml;ngig vom gesperrten Dienst
waren, sind die folgenden Moeglichkeiten
dienstspezifisch:&nbsp;<br>
&nbsp;</p>

<dl>
<dt><b>WWW</b></dt>
</dl>

<ol>
<li>&Auml;hnlich der erw&auml;hnten Ver&auml;nderung der IP-Nummer
eines Serverrechners kann auch die Adresse eines Angebotes auf
einem Server automatisch ver&auml;ndert werden. Eine automatische
Sperrung einzelner Angebote w&uuml;rde dadurch unterlaufen werden,
und man m&uuml;&szlig;te wieder den gesamten Rechner pauschal
sperren. Dort greifen dann wieder die Methoden zum Unterlaufen
einer Komplettsperrung.&nbsp;</li>

<li>Wenn zu einem Angebot eine Suchmaschine existiert, mit der alle
Seiten eines Angebotes nach bestimmten Begriffen durchsucht werden
k&ouml;nnen, ist eine einzelne Seite praktisch unter beliebig
vielen Adressen zu bekommen (n&auml;mlich allen Begriffen, die den
Text in der Suchmaschine finden). Eine Sperrung m&uuml;&szlig;te
hier zus&auml;tzlich den Zugriff auf die Suchmaschine
verhindern.&nbsp;</li>

<li>Das Verfahren des indirekten Zugriffs, wie es unter Mobile-IP
diskutiert wurde, l&auml;&szlig;t sich mit Ver&auml;nderungen auch
f&uuml;r WWW einsetzen: Mit Hilfe eines entfernten Webservers, der
Zugriffe im Auftrag Dritter abwickelt (<i>Proxy-Server</i>), ist
ein indirekter Abruf der Seite m&ouml;glich. Da Proxy-Server mit
Zwischenspeicher zur Beschleunigung von Zugriffen &uuml;blich sind,
ist es in der Regel kein Problem, einen solchen dritten Server zu
finden. Im Rahmen der Zensurdiskussion der letzten Monate sind
mittlerweile im In- und Ausland auch schon Proxy-Server f&uuml;r
solche Umgehungen explizit eingerichtet worden (etwa am MIT fuer
chinesische Staatsb&uuml;rger, die die Zensur im eigenen Land
unterlaufen m&ouml;chten).&nbsp;</li>

<li>Bei verschl&uuml;sselter Kommunikation (etwa mit dem in allen
gaengigen Browsern eingebauten SSL-Support) entsteht ein nicht mehr
in Echtzeit einsehbarer und nicht einfach verf&auml;lschbarer Kanal
zwischen Server und Client. Fuer Dritte ist nicht erkennbar, welche
Seiten abgerufen werden und welche Informationen sie
enthalten.&nbsp;</li>
</ol>

<dl>
<dt><b>News</b></dt>
</dl>

<ol>
<li>Artikel in den USENET News liegen in zahlreichen Kopien auf
Tausenden von Servern &uuml;berall auf der Welt vor.
L&ouml;schungen (<i>Cancel</i>) werden von vielen dieser Server
nicht mehr ausgef&uuml;hrt, nachdem es seit einigen Jahren immer
wieder zu gef&auml;lschten L&ouml;schaufforderungen von Saboteuren
kam. Die gro&szlig;en Archive fuer USENET News (DejaNews und
AltaVista) f&uuml;hren grunds&auml;tzlich keine L&ouml;schungen
aus. &Uuml;ber Archivanfragen ist es daher in der Regel
m&ouml;glich, auch auf &auml;ltere und lokal nicht mehr
verf&uuml;gbare Texte zuzugreifen. Dabei gilt wie bei Suchmaschinen
f&uuml;r Webseiten (siehe oben): Artikel sind nicht nur unter einer
festen Bezeichnung abrufbar, sondern werden auch zu beliebigen im
Artikel enthaltenen Stichworten gefunden.&nbsp;</li>

<li>Im Rahmen einer Untersuchung der bayrischen Staatsanwaltschaft
wurde der Betreiber Compuserve aufgefordert, einige Newsgroups
grunds&auml;tzlich nicht mehr bereitzustellen, da bei ihnen davon
auszugehen sei, dass diese in Deutschland strafrechtlich relevante
Inhalte enthielten. Die Leser dieser Gruppen beziehen diese jetzt
direkt von anderen, nicht gesperrten Newsservern. Ausserdem gehen
die Autoren von Artikeln f&uuml;r solche schlecht verbreiteten
Newsgroups immer mehr dazu &uuml;ber, ihre Artikel zus&auml;tzlich
in andere, thematisch unpassende, aber besser verbreitete Gruppen
zu setzen. So kam es zum Beispiel anl&auml;&szlig;lich der Sperrung
des Servers <tt>www.xs4all.nl</tt> wegen des Angebotes der
verbotenen Zeitschrift Radikal, Ausgabe 154 zweimal zu je einem
Posting der Komplettausgabe der Radikal in den Diskussionsforen <a
href="news:de.soc.zensur">de.soc.zensur</a> (Diskussion ueber
Zensur und Inhaltskontrolle) und <a href="news:de.org.politik.spd">
de.org.politik.spd</a> (Forum des virtuellen Ortsverbandes der
SPD).&nbsp;</li>

<li>Da die Neueinrichtung von Newsgroups technisch automatisiert
werden kann, kommt es vielfach zur Neueinrichtung schlecht
verbreiteter Gruppen unter neuem Namen oder zum Angebot bekannter
Gruppen unter Aliasnamen. So wurde die Gruppe <a href=
"news:de.talk.sex">de.talk.sex</a> (Diskussionsforum ueber
Sexualit&auml;t) an einer deutschen Universit&auml;t mehrere Jahre
lang unter dem Namen de.soc.verkehr gef&uuml;hrt, nachdem dort
entschieden worden war, keine Gruppen mehr anzubieten, deren
Bezeichnung den Begriff sex enth&auml;lt.&nbsp;</li>
</ol>

<h3>Andere Effekte von Sperrungsversuchen&nbsp;</h3>

Jede Sperre kann unterlaufen werden, indem die gesperrte
Information vielfach repliziert wird. Dann ist jedes Vorkommen
dieser Information gesondert zu sperren. Dadurch werden die
unangenehmen Nebenwirkungen der Sperrung vervielfacht, bis die
Kosten fuer die Sperrung ihren Nutzen &uuml;bersteigen. Im Falle
der Sperrung von www.xs4all.nl wegen des Angebotes der verbotenen
Radikal 154 existierten innerhalb k&uuml;rzester Zeit &uuml;ber 40
Kopien der gesperrten Information. Die 6000 aus technischen
Gr&uuml;nden mitgesperrten Anbieter wurden jedoch nicht repliziert.
Bez&uuml;glich der angestrebten Wirkung wurde also eher das
Gegenteil erreicht, w&auml;hrend viele Anbieter durch die
unbeabsichtigten Nebenwirkungen Verluste hinnehmen
mu&szlig;ten.&nbsp; 

<p>Mit Hilfe der USENET News ist diese Replikation tausendfach
automatisiert und mit minimalem Aufwand vorzunehmen. Aus diesem
Grunde kam es nach der Sperrung von xs4all auch zu einer
Verbreitung der Webseiten der Radikal in den News (die Webseiten
der anderen 6000 Kunden von xs4all wurden nicht in die News
eingespielt).&nbsp;</p>

<p>Alle Kommunikation mit Hilfe des TCP/IP-Protokolls ist
konstruktionsbedingt eine individuelle Ende-zu-Ende-Kommunikation
zwischen zwei Partnern. Selbst bei Betrachtung des Dienstes ist
nicht erkennbar, ob die abgerufenen Informationen privater Natur
sind (es ist m&ouml;glich und f&uuml;r viele Anwender auch
notwendig, ihre pers&ouml;nliche Post per WWW zu lesen) oder ob es
sich um &ouml;ffentliche Information handelt. Derartige Information
kann sogar gemischt auf einer Webseite auftreten. Es ist
zweifelhaft, inwieweit eine Kontrolle solcher Verbindungen durch
unspezifisches Abh&ouml;ren (ohne richterlichen Beschlu&szlig;)
gestattet ist, selbst wenn dieses Abh&ouml;ren durch einen Roboter
geschieht, der auf Schl&uuml;sselworte oder Ratings
reagiert.&nbsp;</p>

<p>Nicht nur vom Standpunkt der Kontrolle der Bewerter, sondern
auch vom Standpunkt des technischen Netzbetriebes ist eine
Offenlegung aller Sperrungen unbedingt notwendig. Wenn Sperrungen
von Rechnern oder einzelnen Angeboten massenhaft umgesetzt werden,
ist f&uuml;r den einzelnen Systembetreiber genau wie f&uuml;r den
einzelnen Anwender n&auml;mlich nicht mehr entscheidbar, ob eine
technische St&ouml;rung vorliegt, die zu beheben ist, oder ob eine
inhaltlich begr&uuml;ndete Sperrung vorgenommen wurde. Damit wird
einer zuverl&auml;ssigen Fehleranalyse durch die Betreiber von
Netzen oder einzelnen Maschinen jede Grundlage entzogen, da aus dem
Vorliegen einer St&ouml;rung keine sichere Verhaltensvorschrift zu
ihrer Behebung abgeleitet werden kann. Andererseits k&ouml;nnen
offengelegte Sperrlisten natuerlich leicht als Kataloge fuer
sexuell explizite oder gewaltt&auml;tige Angebote mi&szlig;braucht
werden. Eine Sperrung w&auml;re dann eine Art Qualitaetssiegel.
Offengelegte Sperrungen sind mit entsprechend modifizierten
Programmen au&szlig;erdem automatisiert umgehbar.&nbsp;</p>

<h3>Modifikation des Internet&nbsp;</h3>

In dem heutigen Internet k&ouml;nnen Sperren nach den obigen
Ausf&uuml;hrungen also nicht oder nur mit unvertretbar hohen Kosten
und Nebenwirkungen realisiert werden. Daraus ergibt sich die Frage,
inwieweit das Internet modifiziert werden m&uuml;&szlig;te, um
effizientes Sperren von Inhalten zu erlauben.&nbsp; 

<p>Prinzipiell bieten Firewallsysteme (die von Unternehmen
eingesetzt werden, um ihr Netz gegen unbefugtes Eindringen aus dem
Internet zu sch&uuml;tzen) einen Ansatz, effektive Sperren
aufzubauen. Durch die Philosophie, nur solchen Daten das Passieren
der Barriere zu gestatten, denen es explizit gestattet wurde,
erzwingt man das Einhalten von Richtlinien.&nbsp;</p>

<p>&Auml;hnliche Richtlinien m&uuml;&szlig;ten fuer die Nutzung der
Internet-Dienste durch die Benutzer aufgestellt und ihre Einhaltung
erzwungen werden. Dies kann durch die Verwendung der
Firewalltechnologie als Barriere zwischen den Anwendern und dem
Internet oder durch die Verwendung propriet&auml;rer Protokolle
erzwungen werden. Entscheidend ist, da&szlig; Teilnehmer im Netz
ausschlie&szlig;lich identifizierbar agieren koennen, da&szlig; nur
freigegebene Dienste, Protokolle und Datenformate verwendet werden,
da&szlig; die Verwendung kryptographischer Verfahren verboten wird
und da&szlig; s&auml;mtliche Aktivit&auml;ten protokolliert werden.
Durch diese Massnahmen soll sichergestellt werden, da&szlig; der
Benutzer einer Sperre nicht mehr ausweichen kann durch Wechsel der
Identit&auml;t, des Protokolls oder durch Verschleierung der
Daten.&nbsp;</p>

<p>Unabh&auml;ngig von der Frage, ob ein solches Verfahren mit
einem demokratischen Rechtsstaat vereinbar w&auml;re, gibt es auch
wirtschaftliche und technische Gr&uuml;nde, die dagegen sprechen:
Ein solches Netz w&auml;re zentralistisch gesteuert und k&ouml;nnte
nur unter gro&szlig;em Zeit- und Kostenaufwand an ver&auml;nderte
Anforderungen angepa&szlig;t werden. S&auml;mtliche Online-Dienste
haben dieses Modell auf Druck ihrer kommerziellen Benutzer
aufgegeben. Der administrative Overhead einer solchen L&ouml;sung
auf nationaler Ebene w&auml;re gewaltig. Ausserdem wuerde jede
Beschraenkung kryptographischer Verfahren eine Nutzung des Internet
zur Uebermittlung sensitiver Informationen
beeintr&auml;chtigen.&nbsp;</p>

<p>Insgesamt k&ouml;nnte ein solches Modell katastrophale
Standortnachteile mit sich bringen. Kommunikation ist eine
Ressource, die in ihrer Bedeutung den Arbeitskr&auml;ften oder der
Verkehrsinfrastruktur in keiner Weise nachsteht. Auf der anderen
Seite kann man, wie sich am Beispiel China zeigen l&auml;&szlig;t,
selbst auf diese Art die Verbreitung unerw&uuml;nschter Inhalte nur
begrenzt unterbinden, denn f&uuml;r jede der oben genannten
Massnahmen existieren wiederum Gegenma&szlig;nahmen.&nbsp;</p>

<h3>Bewertung&nbsp;</h3>

Eine zentrale Sperre von Inhalten im Internet l&auml;&szlig;t sich
technisch nicht pa&szlig;genau vornehmen, lie&szlig;e sich von den
Benutzern bei Bedarf umgehen und w&auml;re mit hohen Kosten
verbunden (siehe auch Heimo Ponnath: <a href=
"http://bda.netuse.de/bda/jp/home/heimo.ponnath/articles/SiN.html">
Pornographie im Internet</a>? Dichtung und Wahrheit, inside online
2/3 1996). Bedingt durch die globalen Datennetze zeigt sich hier
der Paradigmenwechsel in den Aufgaben des Staates durch die
Informationsgesellschaft, wie Alexander Rossnagel beschreibt
(Alexander Rossnagel: Globale Datennetze: Ohnmacht des Staates -
Selbstschutz der Buerger, ZRP 1997, Heft 1, 26-30). Die
Ohnmachtserfahrung des Staates in der globalisierten Welt bedeutet
jedoch nicht gleichzeitig eine Kapitulation vor den neuen Gefahren,
sondern die modernen Informationstechnologien bergen
vielf&auml;ltige M&ouml;glichkeiten, da&szlig; der Buerger sich
selbst sch&uuml;tzen kann. Daraus erw&auml;chst die Verpflichtung
f&uuml;r den Staat, Strukturen zu schaffen, die seine B&uuml;rger
bef&auml;higen, ihre Interessen in der Welt der Netze
selbstbestimmt zu sch&uuml;tzen.&nbsp; 

<p>Hier bietet also die dezentrale Kontrolle und Filterung durch
den Benutzer einen L&ouml;sungsansatz. Dazu m&uuml;ssen jedoch die
Bewertungen durch Dritte (etwa nach dem PICS-System) transparent
und nachvollziehbar sein. Beispielhafte Filterkonfigurationen
k&ouml;nnen von einer Vielzahl von Interessengruppen vorgeschlagen
werden; der Benutzer mu&szlig; jedoch die Moeglichkeit haben, seine
eigene Konfiguration individuell vorzunehmen oder
anzupassen.&nbsp;</p>

<p>Ein universelles Rating wie PICS ist mit erh&ouml;htem
Zeitaufwand und zus&auml;tzlichen Kosten verbunden. Eine Reihe von
Anbietern wird daher darauf verzichten. Den Ratingorganisationen
kommt ein hohes Ma&szlig; an Verantwortung zu, da jede Vorbewertung
bereits zur Meinungsbildung der potentiellen Abrufer beitr&auml;gt
und da absichtliche oder unabsichtliche Fehlbewertungen
gro&szlig;en Schaden anrichten koennen. Geht es lediglich um die
Gew&auml;hrleistung eines Jugendschutzes im Internet, w&auml;re es
sehr viel billiger und unkritischer, wenn die Anbieter auf
freiwilliger Basis ihre kindgerechten Materialien kennzeichneten
und spezielle Kinderbrowser &auml;hnlich dem TV-Kinderkanal nur
solche Angebote darstellten (siehe <a href=
"http://www.thehub.com/~orene/liberty/label.html">The Net Labelling
Delusion: Protection or Oppression</a>).&nbsp;</p>

<p>Die Erfahrungen in den USA zeigen, da&szlig; Organisationen das
Instrument der Bewertung von Inhalten f&uuml;r die Durchsetzung
ihrer eigenen politischen Ziele unter dem Deckmantel des
Jugendschutzes oder der Aufrechterhaltung der &ouml;ffentlichen
Moral mi&szlig;brauchen. Es ist zu verhindern, da&szlig; die
Definition moralischer und gesellschaftlicher Werte in den
Aufgabenbereich privater Organisationen &uuml;bertragen wird. Durch
eine Offenlegung der Bewertungsma&szlig;st&auml;be und aller
Bewertungen kann diese Gefahr des Mi&szlig;brauchs reduziert
werden.&nbsp;</p>

<h3>Danksagung&nbsp;</h3>

Wir danken Hannes Federrath und Andreas Pfitzmann von der
Technischen Universitaet Dresden f&uuml;r zahlreiche Anregungen und
Diskussionen, die zur Entstehung dieses Textes beigetragen
haben.&nbsp; 

<h3>Die Autoren&nbsp;</h3>

<a href="mailto:kris@koehntopp.de">Kristian K&ouml;hntopp</a> ist
Diplominformatiker und arbeitet als freiberuflicher Consultant fuer
heterogene Datennetze und Rechnersicherheit.&nbsp; 

<p><a href="mailto:marit@koehntopp.de">Marit K&ouml;hntopp</a> ist
Diplominformatikerin und arbeitet beim Landesbeauftragten f&uuml;r
den Datenschutz Schleswig-Holstein als Referentin in den Bereichen
"Neue Medien und Informationstechnologien" sowie
"Technikfolgenabsch&auml;tzung".&nbsp;</p>

<p><a href="mailto:ms@netuse.de">Martin Seeger</a> ist
Diplominformatiker und Gesch&auml;ftsfuehrer der <a href=
"http://www.netuse.de">NetUSE Kommunikationstechnologie GmbH</a>.
Das Unternehmen besch&auml;ftigt sich mit der
Internet-/Intranet-Technologie und der Sicherheit von Rechnern in
Netzen.&nbsp;<br>
&nbsp;  </p>
